export function validateIPv4(ip: string) {
  // Регулярное выражение для проверки формата IP-адреса
  const ipPattern =
    /^(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9]{2}|[1-9]?[0-9])$/;
  // Проверка соответствия формату
  if (!ipPattern.test(ip)) {
    return false;
  }
  // Разделение IP-адреса на октеты
  const octets = ip.split(".").map(Number);
  // Проверка условий для первого и последнего октетов
  if (
    octets[0] === 0 ||
    octets[0] === 255 ||
    octets[3] === 0 ||
    octets[3] === 255
  ) {
    return false;
  }

  return true;
}
